Repository: Yuleira/SectorZero
Catalog: Localizable.xcstrings
Source language: en
Languages: zh_hans

# privacy_s4_note
source: If voice communication features are enabled, voice data is transmitted in real-time and is not recorded or stored on our servers.
zh_hans: 如果启用了语音通讯功能，语音数据将实时传输，不会在我们的服务器上录制或存储。

# privacy_s4_title
source: 4. How We Use Your Information
zh_hans: 4. 我们如何使用您的信息

# privacy_s5_p1
source: User data is stored on secure servers located within the European Economic Area (EEA).
zh_hans: 用户数据存储在位于欧洲经济区（EEA）的安全服务器上。

# privacy_s5_p2
source: If data is transferred outside the EEA, appropriate safeguards are implemented in accordance with GDPR requirements.
zh_hans: 如果数据传输至 EEA 以外，将按照 GDPR 要求实施适当的保障措施。

# privacy_s5_p3
source: All reasonable technical and organizational security measures are implemented to protect your data.
zh_hans: 我们已实施所有合理的技术和组织安全措施来保护您的数据。

# privacy_s5_title
source: 5. Data Storage & International Transfers
zh_hans: 5. 数据存储与国际传输

# privacy_s6_b1
source: Active accounts: Data is retained while the account remains active.
zh_hans: 活跃账户：账户保持活跃期间数据将被保留。

# privacy_s6_b2
source: Deleted accounts: All associated personal data is permanently erased within 30 days, except where retention is legally required (e.g., financial transaction records).
zh_hans: 已删除账户：所有相关个人数据将在30天内永久删除，法律要求保留的除外（如财务交易记录）。

# privacy_s6_intro
source: We retain personal data only as long as necessary to provide the service.
zh_hans: 我们仅在提供服务所必需的期限内保留个人数据。

# privacy_s6_title
source: 6. Data Retention
zh_hans: 6. 数据保留

# privacy_s7_b1
source: Supabase – Secure cloud database and authentication services
zh_hans: Supabase – 安全的云数据库和身份验证服务

# privacy_s7_b2
source: Apple (StoreKit) – In-app purchase processing
zh_hans: Apple (StoreKit) – 应用内购买处理

# privacy_s7_note
source: These providers process data solely to support app functionality.
zh_hans: 这些提供商仅为支持应用功能而处理数据。

# privacy_s7_p1
source: We do not sell your personal data.
zh_hans: 我们不会出售您的个人数据。

# privacy_s7_p2
source: We only share data with essential service providers:
zh_hans: 我们仅与必要的服务提供商共享数据：

# privacy_s7_title
source: 7. Data Sharing & Third Parties
zh_hans: 7. 数据共享与第三方

# privacy_s8_b1
source: Access your personal data
zh_hans: 访问您的个人数据

# privacy_s8_b2
source: Request correction
zh_hans: 请求更正

# privacy_s8_b3
source: Request deletion
zh_hans: 请求删除

# privacy_s8_b4
source: Request export of your account data
zh_hans: 请求导出您的账户数据

# privacy_s8_b5
source: Withdraw consent
zh_hans: 撤回同意

# privacy_s8_contact
source: For additional requests, contact us via email.
zh_hans: 如有其他请求，请通过电子邮件联系我们。

# privacy_s8_delete_path
source: Settings → Delete Account
zh_hans: 设置 → 删除账户

# privacy_s8_delete_via
source: You may delete your account at any time via:
zh_hans: 您可以随时通过以下方式删除账户：

# privacy_s8_intro
source: Depending on your jurisdiction, you may have the right to:
zh_hans: 根据您所在的司法管辖区，您可能有权：

# privacy_s8_irreversible
source: Account deletion is irreversible.
zh_hans: 账户删除不可逆。

# privacy_s8_title
source: 8. Your Rights
zh_hans: 8. 您的权利

# privacy_s9_p1
source: SectorZero is not intended for children under the age of 13.
zh_hans: SectorZero 不面向13岁以下的儿童。

# privacy_s9_p2
source: We do not knowingly collect personal data from children under 13.
zh_hans: 我们不会故意收集13岁以下儿童的个人数据。

# privacy_s9_p3
source: If such data is discovered, it will be deleted promptly.
zh_hans: 如果发现此类数据，将立即删除。

# privacy_s9_title
source: 9. Children's Privacy
zh_hans: 9. 儿童隐私

# privacy_s10_p1
source: We may update this Privacy Policy from time to time.
zh_hans: 我们可能会不时更新本隐私政策。

# privacy_s10_p2
source: Continued use of the app after updates constitutes acceptance of the revised policy.
zh_hans: 更新后继续使用本应用即表示接受修订后的政策。

# privacy_s10_p3
source: The latest version will always be available through our official channels.
zh_hans: 最新版本将始终通过我们的官方渠道提供。

# privacy_s10_title
source: 10. Changes to This Policy
zh_hans: 10. 本政策的变更

# privacy_s11_intro
source: If you have questions regarding this policy or your data, please contact:
zh_hans: 如果您对本政策或您的数据有任何疑问，请联系：

# privacy_s11_name
source: SectorZero Support
zh_hans: SectorZero 客服支持

# privacy_s11_title
source: 11. Contact
zh_hans: 11. 联系方式

# privacy_title
source: Privacy Policy – SectorZero
zh_hans: 隐私政策 – SectorZero

# product_shards_100
source: 100 Shards
zh_hans: 100 碎片

# product_storage_large
source: Large Storage
zh_hans: 大容量仓库

# product_storage_large_desc
source: Expand your storage to the maximum capacity.
zh_hans: 扩充你的仓库到最大容量。

# profile_about
source: About Us
zh_hans: 关于我们

# profile_about_dev
source: About Us (Coming Soon)
zh_hans: 关于我们（待开发）

# profile_account_security
source: Account Security
zh_hans: 账号安全

# profile_account_security_dev
source: Account Security (Coming Soon)
zh_hans: 账号安全（待开发）

# profile_achievements
source: Achievements
zh_hans: 成就

# profile_all_time
source: All Time
zh_hans: 全部

# profile_app_settings
source: App Settings
zh_hans: App 设置

# profile_buy_resource
source: Buy Resource
zh_hans: 购买资源

# profile_buy_resource_pack
source: Buy Resource Pack
zh_hans: 购买资源包

# profile_coming_soon
source: Coming Soon
zh_hans: 敬请期待

# profile_confirm_delete
source: Confirm Delete
zh_hans: 确认删除

# profile_confirm_delete_account
source: Confirm Account Deletion
zh_hans: 确认删除账户

# profile_data_driven
source: Data-Driven Progress
zh_hans: 数据驱动进度

# profile_days_survival
source: Survival
zh_hans: 生存

# profile_default_username
source: Guest
zh_hans: 游客

# profile_delete_account
source: Delete Account
zh_hans: 删除账户

# profile_delete_account_warning
source: After deleting your account, all your SectorZero data will be permanently deleted and cannot be recovered.
zh_hans: 删除账户后，您的所有 SectorZero 数据将被永久删除且无法恢复。

# profile_delete_confirm_message
source: Are you sure you want to delete? This action cannot be undone.
zh_hans: 确定要删除吗？此操作无法撤销。

# profile_delete_confirm_placeholder
source: Type here to confirm
zh_hans: 在此处输入以确认

# profile_delete_confirm_placeholder %@
source: Enter "%@"
zh_hans: 输入 "%@"

# profile_delete_confirm_prompt
source: Are you sure you want to delete your profile?
zh_hans: 您确定要删除个人资料吗？

# profile_delete_confirm_prompt %@
source: Type "%@" to confirm deletion
zh_hans: 请输入 "%@" 以确认删除

# profile_delete_confirm_required_text
source: Delete
zh_hans: 删除

# profile_delete_confirm_title
source: Delete Confirmation
zh_hans: 删除确认

# profile_delete_data_warning
source: The following SectorZero data will be permanently deleted:
zh_hans: 删除账户后，以下 SectorZero 数据将被永久删除：

# profile_delete_error
source: Failed to delete account
zh_hans: 删除账户失败

# profile_delete_failed
source: Delete Failed
zh_hans: 删除失败

# profile_delete_irreversible
source: This action cannot be undone!
zh_hans: 此操作不可撤销！

# profile_delete_item_auth
source: Login credentials and authentication info
zh_hans: 登录凭证和认证信息

# profile_delete_item_profile
source: Your profile information
zh_hans: 您的个人资料信息

# profile_delete_item_progress
source: All game progress and data
zh_hans: 所有游戏进度和数据

# profile_edit_profile
source: Edit Profile
zh_hans: 编辑档案

# profile_language
source: Language
zh_hans: 语言

# profile_language_settings
source: Language Settings
zh_hans: 语言设置

# profile_language_update_note
source: Interface will update immediately after switching
zh_hans: 切换语言后界面将立即更新

# profile_leaderboard
source: Leaderboard
zh_hans: 排行榜

# profile_logout
source: Sign Out
zh_hans: 退出登录

# profile_logout_action
source: Sign Out
zh_hans: 退出

# profile_logout_confirm_message
source: Are you sure you want to sign out? You will need to sign in again.
zh_hans: 确定要退出登录吗？退出后需要重新登录。

# profile_logout_confirm_title
source: Confirm Sign Out
zh_hans: 确认退出

# profile_material_store
source: Material Store
zh_hans: 物资商城

# profile_no_email
source: No email set
zh_hans: 未设置邮箱

# profile_notifications
source: Notifications
zh_hans: 通知设置

# profile_notifications_dev
source: Notifications (Coming Soon)
zh_hans: 通知设置（待开发）

# profile_privacy_policy
source: Privacy Policy
zh_hans: 隐私政策

# profile_settings
source: Settings
zh_hans: 设置

# profile_stat_area
source: Area
zh_hans: 面积

# profile_stat_buildings_count
source: Buildings
zh_hans: 建筑

# profile_stat_distance
source: Distance
zh_hans: 距离

# profile_stat_exploration_distance
source: Exploration Distance
zh_hans: 探索距离

# profile_stat_poi
source: POI
zh_hans: 兴趣点

# profile_stat_resource_points
source: Resource Points
zh_hans: 资源点

# profile_stat_resources
source: Resources
zh_hans: 资源

# profile_stat_territories
source: Territories
zh_hans: 领地

# profile_stat_territory
source: Territory
zh_hans: 领地

# profile_statistics
source: Statistics
zh_hans: 统计

# profile_survivor_title
source: Survivor Profile
zh_hans: 幸存者档案

# profile_tech_support
source: Tech Support
zh_hans: 技术支持

# profile_this_month
source: This Month
zh_hans: 本月

# profile_this_week
source: This Week
zh_hans: 本周

# profile_today
source: Today
zh_hans: 今天

# profile_view_detailed_stats
source: View Detailed Stats
zh_hans: 查看详细统计

# profile_view_subscription
source: View Subscription
zh_hans: 查看订阅

# profile_vitals
source: Vitals
zh_hans: 状态

# ptt_call_title
source: PTT Call
zh_hans: PTT 呼叫

# quality_damaged
source: Damaged
zh_hans: 破损

# quality_good
source: Good
zh_hans: 良好

# quality_pristine
source: Pristine
zh_hans: 完美

# quality_ruined
source: Ruined
zh_hans: 报废

# quality_worn
source: Worn
zh_hans: 陈旧

# range_format
source: Range: %lld km
zh_hans: 覆盖范围：%lld 公里

# range_unlimited_receive_only
source: Unlimited (Receive only)
zh_hans: 无限制（仅接收）

# rarity_common
source: Common
zh_hans: 普通

# rarity_epic
source: Epic
zh_hans: 史诗

# rarity_legendary
source: Legendary
zh_hans: 传奇

# rarity_rare
source: Rare
zh_hans: 稀有

# rarity_uncommon
source: Uncommon
zh_hans: 优秀

source: Receive Only
zh_hans: 仅接收

source: Recommended Format:
zh_hans: 推荐格式：

source: Refresh
zh_hans: 刷新

# rename_alert_title
source: New Name
zh_hans: 请输入新名称

# resource_circuit
source: Circuit
zh_hans: 电路板

# resource_electronic_parts
source: Electronic Parts
zh_hans: 电子零件

# resource_fabric
source: Fabric
zh_hans: 布料

# resource_glass
source: Glass
zh_hans: 玻璃

# resource_metal
source: Metal
zh_hans: 金属

# resource_segment_picker
source: Resource Segments
zh_hans: 资源分段

# resource_stone
source: Stone
zh_hans: 石材

# resource_wood
source: Wood
zh_hans: 木材

# result_storage_full_warning
source: Storage full — some items could not be collected.
zh_hans: 存储已满——部分物品未能收入背包。

# reward_tier_bronze
source: Bronze
zh_hans: 铜级

# reward_tier_diamond
source: Diamond
zh_hans: 钻石级

# reward_tier_gold
source: Gold
zh_hans: 金级

# reward_tier_none
source: None
zh_hans: 无

# reward_tier_silver
source: Silver
zh_hans: 银级

# salvage_ai_generated
source: AI Generated
zh_hans: AI 生成

# salvage_coins_earned
source: Coins Earned
zh_hans: 获得金币

# salvage_danger_level_format
source: Danger Level %d
zh_hans: 危险等级 %d

# salvage_item_count_format
source: %d types
zh_hans: %d 种

# salvage_items_obtained
source: Items Obtained
zh_hans: 获得物品

# salvage_story
source: Story
zh_hans: 故事

# salvage_success_title
source: Salvage Successful!
zh_hans: 回收成功！

source: Save Callsign
zh_hans: 保存呼号

source: Search channels...
zh_hans: 搜索频道...

# segment_backpack
source: Backpack
zh_hans: 背包

# segment_poi_list
source: POI List
zh_hans: POI列表

# segment_purchased
source: Purchased
zh_hans: 已购

# segment_territory
source: Territory
zh_hans: 领地

# segment_territory_resources
source: Territory Resources
zh_hans: 领地资源

# segment_trade
source: Trade
zh_hans: 交易

# segment_trade_market
source: Trade Market
zh_hans: 交易市场

# segment_vault
source: Vault
zh_hans: 金库

source: Select Channel Type
zh_hans: 选择频道类型

source: Select Communication Device
zh_hans: 选择通讯设备，不同设备有不同覆盖范围

source: Sending...
zh_hans: 发送中...

# shards_balance_format
source: Balance: %lld Shards
zh_hans: 碎片余额：%lld

source: Simplified Chinese
zh_hans: 简体中文

# status_active
source: Active
zh_hans: 运行中

# status_constructing
source: Constructing
zh_hans: 建造中

# store_already_purchased
source: Already Purchased
zh_hans: 已购买

# store_auto_renewal_disclosure
source: Subscriptions automatically renew unless canceled at least 24 hours before the end of the current period. You can manage and cancel your subscriptions in your device's Settings > Apple ID > Subscriptions.
zh_hans: 订阅将自动续期，除非在当前周期结束前至少24小时取消。您可以在设备的「设置」>「Apple ID」>「订阅」中管理和取消订阅。

# store_benefit_daily_coins_5
source: Daily 5 Coins
zh_hans: 每日 5 金币

# store_benefit_daily_coins_15
source: Daily 15 Coins
zh_hans: 每日 15 金币

# store_benefit_daily_coins_30
source: Daily 30 Coins
zh_hans: 每日 30 金币

# store_benefit_daily_energy_3
source: Daily Energy ×3
zh_hans: 每日能量 ×3

# store_benefit_daily_energy_5
source: Daily Energy ×5
zh_hans: 每日能量 ×5

# store_benefit_daily_scans_5
source: Receive 5 Daily Scans
zh_hans: 每日获得 5 次扫描

# store_benefit_daily_scans_10
source: Receive 10 Daily Scans
zh_hans: 每日获得 10 次扫描

# store_benefit_storage_150
source: Expand to 150 Storage
zh_hans: 扩展至 150 存储空间

# store_benefit_storage_300
source: Expand to 300 Storage
zh_hans: 扩展至 300 存储空间

# store_benefit_storage_600
source: Expand to 600 Storage
zh_hans: 扩展至 600 存储空间

# store_benefit_territories_5
source: Claim up to 5 Territories
zh_hans: 最多占领 5 块领地

# store_benefit_territories_10
source: Claim up to 10 Territories
zh_hans: 最多占领 10 块领地

# store_benefit_territories_25
source: Claim up to 25 Territories
zh_hans: 最多占领 25 块领地

# store_benefit_unlimited_scans
source: Unlimited AI Scans
zh_hans: 无限 AI 扫描

# store_best_value
source: Best Value
zh_hans: 超值之选

# store_coin_topup
source: Coin Top-up
zh_hans: 充值

# store_current_plan
source: Current Plan
zh_hans: 当前方案

# store_energy_packs
source: Energy Packs
zh_hans: 能量包

# store_exchange_button
source: Exchange
zh_hans: 兑换

# store_insufficient_coins
source: Insufficient coins for exchange.
zh_hans: 以太币余额不足，无法兑换。

# store_items
source: Items
zh_hans: 物品

# store_loading_products
source: Connecting to Supply Satellite...
zh_hans: 正在连接补给卫星...

# store_network_error
source: Network error. Please check your connection and try again.
zh_hans: 网络错误，请检查连接后重试。

# store_no_products
source: No products available at the moment.
zh_hans: 暂无可购买商品。

# store_per_month
source: /month
zh_hans: /月

# store_per_year
source: /year
zh_hans: /年

# store_popular
source: Popular
zh_hans: 热门

# store_premium_currency
source: Premium Currency
zh_hans: 高级货币

# store_purchase_failed
source: Purchase failed. Please try again.
zh_hans: 购买失败，请重试。

# store_purchase_successful
source: Purchase successful!
zh_hans: 购买成功！

# store_purchased
source: Purchased
zh_hans: 已购买

# store_refresh
source: Refresh Store
zh_hans: 刷新商店

# store_resource_exchange
source: Resource Exchange
zh_hans: 资源兑换

# store_restore_completed
source: Restore completed
zh_hans: 恢复完成

# store_restore_purchases
source: Restore Purchases
zh_hans: 恢复购买

# store_subscribe
source: Subscribe
zh_hans: 订阅

# store_subscriptions
source: Subscriptions
zh_hans: 订阅方案

# store_terms_of_service
source: Terms of Service
zh_hans: 服务条款

# store_title
source: Aether Supply
zh_hans: 以太补给站

# store_upgrade
source: Upgrade
zh_hans: 升级

# store_verification_failed
source: Verification failed. Please contact support.
zh_hans: 验证失败，请联系客服。

source: Subscribe
zh_hans: 订阅

# subscribe_channels_hint
source: Subscribe to channels for updates
zh_hans: 订阅频道以获取更新

# subscribe_to_see_messages
source: Subscribe to channels to see messages here
zh_hans: 订阅频道后，消息会显示在这里

source: Subscribed
zh_hans: 已订阅

source: Subscription Expired
zh_hans: 订阅已过期

# subscription_expires_in_days_format
source: Expires in %d days
zh_hans: 剩余 %d 天

# subscription_renews_on
source: Renews on %@
zh_hans: 续订日期: %@

source: Switch
zh_hans: 切换

# tab_map
source: Map
zh_hans: 地图

# tab_personal
source: Personal
zh_hans: 个人

# tab_profile
source: Profile
zh_hans: 个人

# tab_resources
source: Resources
zh_hans: 资源

# tab_store
source: Store
zh_hans: 商店

# tab_territory
source: Territory
zh_hans: 领地

# territory_area
source: Area
zh_hans: 面积

# territory_area_check_failed_format
source: Area check: %.0fm² ✗
zh_hans: 面积检查: %.0fm² ✗

# territory_area_check_passed_format
source: Area check: %.0fm² ✓
zh_hans: 面积检查: %.0fm² ✓

# territory_build_hint
source: Start building to develop your territory
zh_hans: 开始建造以发展您的领地

# territory_building_system
source: Building System
zh_hans: 建筑系统

source: Territory Buildings
zh_hans: 领地建筑

# territory_clear_logs
source: Clear Logs
zh_hans: 清空日志

# territory_completion_time
source: Claimed At
zh_hans: 圈地时间

# territory_count_label
source: Territories
zh_hans: 领地数量

# territory_danger_entering_others_format
source: Danger: About to enter another player's territory! (%dm)
zh_hans: 危险：即将进入他人领地！（%dm）

# territory_debug_mode
source: Debug Mode
zh_hans: 调试模式

# territory_delete
source: Delete Territory
zh_hans: 删除领地

# territory_delete_confirm_message
source: Are you sure you want to delete this territory? All buildings within will also be removed. This action cannot be undone.
zh_hans: 确定要删除这块领地吗？领地内的所有建筑也将被移除。此操作无法撤销。

# territory_delete_confirm_title
source: Delete Territory
zh_hans: 删除领地

# territory_delete_success
source: Territory deleted successfully
zh_hans: 领地删除成功

# territory_distance_check_failed_format
source: Distance check: %.0fm ✗
zh_hans: 距离检查: %.0fm ✗

# territory_distance_check_passed_format
source: Distance check: %.0fm ✓
zh_hans: 距离检查: %.0fm ✓

# territory_distance_from_start_format
source: %.1fm from start (need ≤30m)
zh_hans: 距起点 %.1fm (需≤30m)

# territory_distance_warning_format
source: Distance warning: %@, distance %dm
zh_hans: 距离预警：%@，距离 %dm

# territory_empty_description
source: Go to the map to start claiming!
zh_hans: 前往地图页面开始圈地吧！

# territory_empty_title
source: No Territories
zh_hans: 暂无领地

# territory_export_logs
source: Export Logs
zh_hans: 导出日志

# territory_login_prompt
source: Log in to view and manage your territories
zh_hans: 登录后即可查看和管理你的领地

# territory_logs_count_format
source: %lld Logs
zh_hans: %lld 条日志

# territory_logs_empty_hint
source: Logs will appear here after starting territory tracking
zh_hans: 开始圈地追踪后，日志将在此显示

# territory_loop_closed_format
source: Loop closed! %.1fm from start
zh_hans: 闭环成功！距起点 %.1fm

# territory_map_unavailable
source: Unable to Display Map
zh_hans: 无法显示地图

# territory_my_title
source: My Territories
zh_hans: 我的领地

# territory_no_buildings
source: No Buildings Yet
zh_hans: 暂无建筑

# territory_no_logs
source: No Logs
zh_hans: 暂无日志

# territory_no_self_intersection
source: Self-intersection check: no intersection ✓
zh_hans: 自交检测: 无交叉 ✓

# territory_not_tracking
source: Not Tracking
zh_hans: 未追踪

# territory_overspeed_stopped_format
source: Overspeed %.1f km/h, tracking stopped
zh_hans: 超速 %.1f km/h，已停止追踪

# territory_point_check_failed_format
source: Point check: %d points ✗
zh_hans: 点数检查: %d个点 ✗

# territory_point_check_passed_format
source: Point check: %d points ✓
zh_hans: 点数检查: %d个点 ✓

# territory_points_count_format
source: %d points
zh_hans: %d 个

# territory_points_format
source: Territory Points %1$lld
zh_hans: 领地积分 %1$lld

# territory_record_first_point
source: Record first point (start)
zh_hans: 记录第 1 个点（起点）

# territory_record_point_format
source: Record point #%d, %.1fm from last
zh_hans: 记录第 %d 个点，距上点 %.1fm

# territory_rename
source: Rename Territory
zh_hans: 重命名领地

# territory_rename_failed
source: Rename failed. Please try again.
zh_hans: 重命名失败，请稍后重试。

# territory_rename_placeholder
source: Enter new territory name
zh_hans: 输入新的领地名称

# territory_rename_required
source: Please enter a name for the territory.
zh_hans: 请为领地输入名称。

# territory_rename_success
source: Territory renamed
zh_hans: 领地已重命名

# territory_self_intersection_found_format
source: Self-intersection: segment %d-%d intersects segment %d-%d
zh_hans: 自交检测: 线段%d-%d 与 线段%d-%d 相交

# territory_start_claiming_tracking
source: Start claiming tracking
zh_hans: 开始圈地追踪

# territory_stop_tracking_points_format
source: Stop tracking, %d points total
zh_hans: 停止追踪，共 %d 个点

# territory_total_area_label
source: Total Area
zh_hans: 总面积

# territory_track_points
source: Track Points
zh_hans: 轨迹点数

# territory_tracking_active
source: Tracking
zh_hans: 追踪中

source: Territory Trading
zh_hans: 领地交易

# territory_unnamed
source: Unnamed Territory
zh_hans: 未命名领地

# territory_upload_success_area_format
source: Territory uploaded successfully, area: %.0fm²
zh_hans: 领地上传成功，面积: %.0fm²

# territory_validation_passed_format
source: Territory validation passed! Area: %.0fm²
zh_hans: 领地验证通过！面积: %.0fm²

# territory_warning_approaching_others_format
source: Warning: Approaching another player's territory (%dm)
zh_hans: 警告：正在靠近他人领地（%dm）

# territory_warning_near_others_format
source: Notice: %dm from another player's territory
zh_hans: 注意：距离他人领地 %dm

# test_ai_generator_debug
source: AI Generator Debug
zh_hans: AI 生成器调试

# test_ai_item_generation
source: AI Item Generation Test
zh_hans: AI 物品生成测试

# test_branch_universe_page
source: This is the branch universe test page
zh_hans: 这里是分支宇宙的测试页

# test_developer
source: Developer Tests
zh_hans: 开发测试

# test_edge_function_fallback
source: Test Edge Function and fallback
zh_hans: 测试 Edge Function 和降级方案

# test_fallback_solution
source: Fallback Solution
zh_hans: 降级方案

source: Test Modules
zh_hans: 测试模块

# test_supabase_connect
source: Test Connection
zh_hans: 测试连接

source: Test Supabase connection
zh_hans: 测试 Supabase 连接

# test_supabase_testing
source: Testing...
zh_hans: 测试中...

# test_supabase_verify_tables
source: Verify Data Tables
zh_hans: 验证数据表

# test_supabase_verifying
source: Verifying...
zh_hans: 验证中...

# test_territory
source: Territory Test
zh_hans: 圈地测试

# test_territory_claiming
source: Territory Claiming Test
zh_hans: 圈地功能测试

# test_test_result
source: Test Results
zh_hans: 测试结果

# tier_archon
source: Archon Tier
zh_hans: 执政官会员

# tier_free
source: Free Tier
zh_hans: 免费会员

# tier_pioneer
source: Pioneer Tier
zh_hans: 开拓者会员

# tier_salvager
source: Salvager Tier
zh_hans: 资源回收者

# trade_accept
source: Accept Trade
zh_hans: 接受交易

# trade_accepted_by_format
source: Accepted by @%@
zh_hans: 被 @%@ 接受

# trade_accepter
source: Accepter
zh_hans: 接受者

# trade_accepting
source: Accepting...
zh_hans: 接受中...

# trade_add_item
source: Add Item
zh_hans: 添加物品

# trade_cancel
source: Cancel Listing
zh_hans: 取消挂单

# trade_cancel_offer
source: Cancel Listing
zh_hans: 取消挂单

# trade_cancel_offer_message
source: Are you sure you want to cancel this listing? Items will be returned to your inventory.
zh_hans: 确定要取消此挂单吗？物品将退回到你的背包。

# trade_cancel_offer_title
source: Cancel Listing?
zh_hans: 取消挂单？

# trade_comment
source: Comment
zh_hans: 评语

# trade_comment_optional
source: Comment (Optional)
zh_hans: 评语（可选）

# trade_comment_placeholder
source: Share your thoughts about this trade...
zh_hans: 分享你对这次交易的想法...

# trade_confirm_accept
source: Confirm Trade
zh_hans: 确认交易

# trade_confirm_add
source: Confirm
zh_hans: 确认添加

# trade_confirm_cancel
source: Confirm Cancellation
zh_hans: 确认取消

# trade_confirm_message
source: Please review the trade details:
zh_hans: 请确认交易详情：

# trade_confirm_title
source: Confirm Trade
zh_hans: 确认交易

# trade_create_offer
source: Create Listing
zh_hans: 发布挂单

# trade_debug_current_config
source: Current Config (Debug)
zh_hans: 当前配置（调试）

# trade_debug_fill_inventory
source: Fill Inventory (Debug)
zh_hans: 填充库存（调试）

# trade_debug_inventory_count
source: Inventory: %lld items
zh_hans: 库存：%lld 个物品

# trade_debug_test_database
source: Test Database (Debug)
zh_hans: 测试数据库（调试）

# trade_debug_tools
source: Debug Tools
zh_hans: 调试工具

# trade_empty_history
source: No trade history yet
zh_hans: 暂无交易记录

# trade_empty_offers
source: No listings yet
zh_hans: 暂无挂单

# trade_error_already_rated
source: You have already rated this trade
zh_hans: 您已经评价过此交易

# trade_error_cannot_accept_own_offer
source: You cannot accept your own listing
zh_hans: 不能接受自己的挂单

# trade_error_insufficient_items
source: Insufficient items: %@ (need %lld, have %lld)
zh_hans: 物品不足：%@（需要 %lld，拥有 %lld）

# trade_error_invalid_parameters
source: Invalid parameters
zh_hans: 参数无效
